app/controllers/posts_controller.rb

	def create
		@post= Post.create params[:post]
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "saljdaslkd"], ["created_at", Wed, 04 Sep 2013 15:51:52 UTC +00:00], ["title", "This is a post"], ["updated_at", Wed, 04 Sep 2013 15:51:52 UTC +00:00]]

	def update
		@post = Post.find(params[:id])

		if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'A new', "updated_at" = '2013-09-05 00:59:23.216798' WHERE "posts"."id" = 1